void main()
{
	
	/* 2022 - 12 - 21
	// 주석
	// 주석은 컴파일되지 않습니다.
	
	// 전체 주석
	/* <- 주석을 시작하는 위치
		TAB은 오른쪽 이동
		SHITF + TAB은 왼쪽 이동
		C 언어 프로그램 완성
		C 언어로 게임 만들기
		C 언어 마스터하기
	 // 주석을 끝내는 위치
	----------------------------*/
	
	/* 2022-12-22
		변수란?
		데이터를 저장할 수 있는 메모리 공간을 생성하는 것입니다.
	
		자료형이란?
		데이터를 저장하기 위해 데이터의 형태를 정해주는 것입니다.

		문자형 -> char(1 byte)
		정수형 -> short(2 byte), int(4 byte), long(4 or 8 byte/운영체제에따라), long long(8 byte)
		실수형 -> float(4 byte), double(8 byte), long double(8 or 16 byte/운영체제에따라)
		
		각각의 자료형마다 크기가 정해져 있으며, 자료형의 크기는 바이트 단위로 이루어져 있습니다.
		자료형의 경우 자료형에 따라 저장할 수 있는 값의 종류와 범위가 결정되어 있습니다.
	
		프로그램 실행 순서
		위에서 아래로 실행

		대입 연산자란?
		변수에 값 또는 객체를 저장할 수 있는 연산자입니다.
		대입 연산자("=")의 경우 오른쪽에 있는 피연사자를 왼쪽에 있는 피연산자에 저장하는 연산자입니다.
	
		변수의 초기화
		최초로 변수에 값을 저장해주는 과정
		int variable = 10;

		variable = 99;

		char alphabet = 'A';

		alphabet = 'B';

		float pi = 3.14;

		pi = 8.67;
	
		변수의 명명규칙
		1. 변수의 첫번째 글자를 숫자로 시작할 수 없다.
		2. 변수의 이름에 공백이 포함될 수 없습니다.
		3. 사용 가능한 특수 기호는 "_"와, "$"만 사용할 수 있다.
		4. 변수의 이름으로 예약어를 사용할 수 없다.
		5. 변수의 이름은 대소문자를 구분한다.
		6. 변수의 이름은 중복을 허용하지 않는다.

	----------------------*/

	int variable = 10;

	variable = 99;

	char alphabet = 'A';

	alphabet = 'B';

	float pi = 3.14;

	pi = 8.67;
}